src/cf/AccumulationRegisters/ДенежныеСредстваВКассах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваВКассах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОбработанныеОперацииAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбработанныеОперацииAPI</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МоментСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/ПоступлениеНаличных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПоступлениеНаличных</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредстваВКассах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/ВыдачаНаличных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВыдачаНаличных</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредстваВКассах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/HTTPServices/CashAPI/Ext/Module.bsl
Функция GetBalances(Запрос)
   
   Попытка
	   
	   ЗапросДанных = Новый Запрос;
	   ЗапросДанных.Текст =
	   "ВЫБРАТЬ
	   |	Кассы.Ссылка КАК Касса,
	   |	Кассы.Наименование КАК Наименование,
	   |	ЕСТЬNULL(Остатки.СуммаОстаток, 0) КАК Остаток
	   |ИЗ
	   |	Справочник.Кассы КАК Кассы
	   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваВКассах.Остатки(&МоментОстатков, ) КАК Остатки
	   |		ПО Кассы.Ссылка = Остатки.Касса
	   |ГДЕ
	   |	НЕ Кассы.ПометкаУдаления
	   |
	   |УПОРЯДОЧИТЬ ПО
	   |	Кассы.Наименование,
	   |	Кассы.Ссылка";
	   
	   ЗапросДанных.УстановитьПараметр("МоментОстатков",ТекущаяДатаСеанса());     
	   РезультатЗапроса = ЗапросДанных.Выполнить();
	   Выборка = РезультатЗапроса.Выбрать();
	   
	   Кассы = Новый Массив;
	   
	   Пока Выборка.Следующий() Цикл
		   
		   ДанныеКассы = Новый Структура;
		   ДанныеКассы.Вставить("id", Строка(Выборка.Касса.УникальныйИдентификатор()));
		   ДанныеКассы.Вставить("name", Выборка.Наименование);  
		   ДанныеКассы.Вставить("balance", Выборка.Остаток);
		   Кассы.Добавить(ДанныеКассы);
		   
	   КонецЦикла;
	   
	   ДанныеОтвета = Новый Структура;
	   ДанныеОтвета.Вставить("data", Кассы);
	   
	   Возврат СформироватьJSONОтвет(200, ДанныеОтвета);
	   
   Исключение
	   
	   ЗаписьЖурналаРегистрации(
	   "CashAPI.GetBalances",
	   УровеньЖурналаРегистрации.Ошибка,
	   ,
	   ,
	   ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	   
	   ОписаниеОшибки = Новый Структура;
	   ОписаниеОшибки.Вставить("code", "internal_error");
	   ОписаниеОшибки.Вставить("message", "Внутренняя ошибка сервера.");
	   
	   ДанныеОтвета = Новый Структура;
	   ДанныеОтвета.Вставить("error", ОписаниеОшибки);
	   
	   Возврат СформироватьJSONОтвет(500,ДанныеОтвета);

   КонецПопытки;
   
КонецФункции 

Функция PostOperation(Запрос) 
   
   ИдентификаторОперацииСтрокой = Неопределено;
   ТипОперации = Неопределено; 
   Сумма = Неопределено;
   ИдентификаторКассыСтрокой = Неопределено; 
   ТранзакцияАктивна = Ложь;

   ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
   
   Если ПустаяСтрока(ТелоЗапроса) Тогда
	   Возврат СформироватьОтветОбОшибке(400, "empty_body", "Тело запроса не должно быть пустым.");
   КонецЕсли;
   
   Попытка
	   ДанныеЗапроса = ПрочитатьЗначениеJSON(ТелоЗапроса);
   Исключение
	   Возврат СформироватьОтветОбОшибке(400, "invalid_json", "Некорректный JSON.");
   КонецПопытки;
   
   Если ТипЗнч(ДанныеЗапроса) <> Тип("Структура") Тогда
	   Возврат СформироватьОтветОбОшибке(400, "invalid_json", "Ожидается JSON-объект.");
   КонецЕсли;
      
   Если Не ДанныеЗапроса.Свойство("operationId", ИдентификаторОперацииСтрокой) Тогда
	   Возврат СформироватьОтветОбОшибке(400, "missing_operation_id", "Не указано обязательное поле operationId.");
   КонецЕсли;
   
   Если Не ДанныеЗапроса.Свойство("type", ТипОперации) Тогда
	   Возврат СформироватьОтветОбОшибке(400, "missing_type", "Не указано обязательное поле type.");
   КонецЕсли;
   
   Если Не ДанныеЗапроса.Свойство("cashboxId", ИдентификаторКассыСтрокой) Тогда
	   Возврат СформироватьОтветОбОшибке(400, "missing_cashbox_id","Не указано обязательное поле cashboxId.");
   КонецЕсли;
   
   Если Не ДанныеЗапроса.Свойство("amount", Сумма) Тогда
	   Возврат СформироватьОтветОбОшибке(400, "missing_amount", "Не указано обязательное поле amount.");
   КонецЕсли;
   
   Если ТипЗнч(ИдентификаторОперацииСтрокой) <> Тип("Строка") Или ПустаяСтрока(ИдентификаторОперацииСтрокой) Тогда 
	   Возврат СформироватьОтветОбОшибке(400, "invalid_operation_id", "Поле operationId должно содержать UUID.");
   КонецЕсли;
   
   Если ТипЗнч(ТипОперации) <> Тип("Строка") Или (ТипОперации <> "income"
	   И ТипОперации <> "expense") Тогда
	   Возврат СформироватьОтветОбОшибке(400, "invalid_operation_type", "Поле type должно иметь значение income или expense.");
   КонецЕсли;
   
   Если ТипЗнч(ИдентификаторКассыСтрокой) <> Тип("Строка")
	   Или ПустаяСтрока(ИдентификаторКассыСтрокой) Тогда
	   Возврат СформироватьОтветОбОшибке(400, "invalid_cashbox_id", "Поле cashboxId должно содержать UUID.");
   КонецЕсли;
   
   Если ТипЗнч(Сумма) <> Тип("Число") Тогда
	   Возврат СформироватьОтветОбОшибке(400, "invalid_amount", "Поле amount должно быть числом.");
   КонецЕсли;
   
   Если Сумма <= 0 Тогда
	   Возврат СформироватьОтветОбОшибке(400, "invalid_amount", "Поле amount должно быть больше нуля.");   
   КонецЕсли;
   
   Если Окр(Сумма, 2) <> Сумма Тогда 
	   Возврат СформироватьОтветОбОшибке(400, "invalid_amount_precision", "Поле amount должно содержать не более двух знаков после запятой.");
   КонецЕсли;
   
   Попытка 
	   ИдентификаторОперации = Новый УникальныйИдентификатор(ИдентификаторОперацииСтрокой); 
	   ИдентификаторОперацииСтрокой = Строка(ИдентификаторОперации);
   Исключение
	   Возврат СформироватьОтветОбОшибке(400, "invalid_operation_id", "Поле operationId содержит некорректный UUID.");
   КонецПопытки;
   
   Попытка
	   ИдентификаторКассы = Новый УникальныйИдентификатор(ИдентификаторКассыСтрокой);
   Исключение
	   Возврат СформироватьОтветОбОшибке(400, "invalid_cashbox_id", "Поле cashboxId содержит некорректный UUID.");
   КонецПопытки;
     
   Касса = НайтиКассуПоИдентификатору(ИдентификаторКассы);
   
   Если Касса = Неопределено Тогда
	   Возврат СформироватьОтветОбОшибке(404, "cashbox_not_found", "Касса не найдена.");
   КонецЕсли;
   
   НачатьТранзакцию();
   ТранзакцияАктивна = Истина;
   
   Попытка
	   Блокировка = Новый БлокировкаДанных;
	   ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОбработанныеОперацииAPI");
	   ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	   ЭлементБлокировки.УстановитьЗначение("ИдентификаторОперации", ИдентификаторОперацииСтрокой);
	   Блокировка.Заблокировать();
	 	   
	   СуществующаяОперация = НайтиОбработаннуюОперацию(ИдентификаторОперацииСтрокой);
	   
	   Если СуществующаяОперация <> Неопределено Тогда
		   Если СуществующаяОперация.ТипОперации = ТипОперации
			   И СуществующаяОперация.Касса = Касса
			   И СуществующаяОперация.Сумма = Сумма Тогда
			   
			   ДокументСсылка = СуществующаяОперация.Документ;
			   
			   Если ТранзакцияАктивна Тогда
				   ОтменитьТранзакцию();
				   ТранзакцияАктивна = Ложь;
			   КонецЕсли;
			   
			   Возврат СформироватьУспешныйОтветОперации(200,ИдентификаторОперацииСтрокой,ДокументСсылка);
		   Иначе
			   
			   Если ТранзакцияАктивна Тогда
				   ОтменитьТранзакцию();
				   ТранзакцияАктивна = Ложь;
			   КонецЕсли;
			   
			   Возврат СформироватьОтветОбОшибке(409,"operation_id_conflict","Операция с таким operationId уже существует с другими параметрами.");
		   КонецЕсли;
	   КонецЕсли;
	   
	   Если ТипОперации = "income" Тогда
		   ДокументОбъект = Документы.ПоступлениеНаличных.СоздатьДокумент();
	   Иначе
		   ДокументОбъект = Документы.ВыдачаНаличных.СоздатьДокумент();
	   КонецЕсли;
	   
	   ДокументОбъект.Дата = ТекущаяДатаСеанса();
	   ДокументОбъект.Касса = Касса;
	   ДокументОбъект.Сумма = Сумма;
	   
	   Попытка
		   
		   ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		   
	   Исключение
		   
		   ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		   
		   Если ТранзакцияАктивна Тогда
			   ОтменитьТранзакцию();
			   ТранзакцияАктивна = Ложь;
		   КонецЕсли;
		   
		   РезультатКонтроля = Неопределено;
		   ДокументОбъект.ДополнительныеСвойства.Свойство("РезультатКонтроля", РезультатКонтроля);
		   
		   Если РезультатКонтроля = Неопределено Тогда
			   
			   ЗаписьЖурналаРегистрации(
			   "CashAPI.PostOperation",
			   УровеньЖурналаРегистрации.Ошибка,
			   , ,
			   ТекстОшибки);
			   
			   Возврат СформироватьОтветОбОшибке(500,"internal_error","Внутренняя ошибка сервера.");
			   
		   КонецЕсли;
		   
		   Дефицит = 0;
		   РезультатКонтроля.Свойство("Дефицит", Дефицит);
		   
		   Возврат СформироватьОтветОНехваткеСредств(Дефицит);
		   
	   КонецПопытки;
	   	   
	   ЗаписьОперации = РегистрыСведений.ОбработанныеОперацииAPI.СоздатьМенеджерЗаписи();
	   ЗаписьОперации.ИдентификаторОперации = ИдентификаторОперацииСтрокой;
	   ЗаписьОперации.ТипОперации = ТипОперации;
	   ЗаписьОперации.Касса = Касса;
	   ЗаписьОперации.Сумма = Сумма;
	   ЗаписьОперации.Документ = ДокументОбъект.Ссылка;
	   ЗаписьОперации.МоментСоздания = ТекущаяДатаСеанса();
	   ЗаписьОперации.Записать();
	   
	   ЗафиксироватьТранзакцию();
	   
	   Возврат СформироватьУспешныйОтветОперации(201,ИдентификаторОперацииСтрокой,ДокументОбъект.Ссылка);
	   
	   
   Исключение
	   
	   Если ТранзакцияАктивна Тогда
		   ОтменитьТранзакцию();
		   ТранзакцияАктивна = Ложь;
	   КонецЕсли;
	   
	   ЗаписьЖурналаРегистрации(
	   "CashAPI.PostOperation",
	   УровеньЖурналаРегистрации.Ошибка,
	   ,
	   ,
	   ПодробноеПредставлениеОшибки(
	   ИнформацияОбОшибке()));
	   
	   Возврат СформироватьОтветОбОшибке(500, "internal_error", "Внутренняя ошибка сервера.");
	   
   КонецПопытки;
   
КонецФункции

Функция СформироватьJSONОтвет(КодСостояния, Данные)
   
   ЗаписьJSON = Новый ЗаписьJSON;
   ЗаписьJSON.УстановитьСтроку();
   
   ЗаписатьJSON(ЗаписьJSON, Данные);
   
   ТелоОтвета = ЗаписьJSON.Закрыть();
   
   Ответ = Новый HTTPСервисОтвет(КодСостояния);
   
   Ответ.Заголовки.Вставить(
   "Content-Type",
   "application/json; charset=utf-8");
   
   Ответ.УстановитьТелоИзСтроки(
   ТелоОтвета,
   КодировкаТекста.UTF8,
   ИспользованиеByteOrderMark.НеИспользовать);
   
   Возврат Ответ;
   
КонецФункции  

Функция НайтиКассуПоИдентификатору(ИдентификаторКассы)
   
   СсылкаКассы = Справочники.Кассы.ПолучитьСсылку(ИдентификаторКассы);
   
   ЗапросДанных = Новый Запрос;
   ЗапросДанных.Текст =
   "ВЫБРАТЬ ПЕРВЫЕ 1
   |   Кассы.Ссылка КАК Ссылка
   |ИЗ
   |   Справочник.Кассы КАК Кассы
   |ГДЕ
   |   Кассы.Ссылка = &Ссылка
   |   И НЕ Кассы.ПометкаУдаления";
   
   ЗапросДанных.УстановитьПараметр("Ссылка", СсылкаКассы);
   
   Выборка = ЗапросДанных.Выполнить().Выбрать();
   
   Если Выборка.Следующий() Тогда
	   Возврат Выборка.Ссылка;
   КонецЕсли;
   
   Возврат Неопределено;
   
КонецФункции                  

Функция НайтиОбработаннуюОперацию(ИдентификаторОперации)
   
   ЗапросДанных = Новый Запрос;
   ЗапросДанных.Текст =
   "ВЫБРАТЬ ПЕРВЫЕ 1
   |   Операции.ТипОперации КАК ТипОперации,
   |   Операции.Касса КАК Касса,
   |   Операции.Сумма КАК Сумма,
   |   Операции.Документ КАК Документ
   |ИЗ
   |   РегистрСведений.ОбработанныеОперацииAPI КАК Операции
   |ГДЕ
   |   Операции.ИдентификаторОперации =
   |       &ИдентификаторОперации";
   
   ЗапросДанных.УстановитьПараметр("ИдентификаторОперации", ИдентификаторОперации);
   
   Выборка = ЗапросДанных.Выполнить().Выбрать();
   
   Если Не Выборка.Следующий() Тогда
	   Возврат Неопределено;
   КонецЕсли;
   
   Результат = Новый Структура;
   
   Результат.Вставить("ТипОперации", Выборка.ТипОперации);
   Результат.Вставить("Касса", Выборка.Касса); 
   Результат.Вставить("Сумма", Выборка.Сумма);
   Результат.Вставить("Документ", Выборка.Документ);
   
   Возврат Результат;
   
КонецФункции  

Функция СформироватьОтветОбОшибке(КодСостояния, КодОшибки, ТекстОшибки)
   
   Ошибка = Новый Структура;
   Ошибка.Вставить("code",КодОшибки);
   Ошибка.Вставить("message",ТекстОшибки);
   
   ДанныеОтвета = Новый Структура;
   ДанныеОтвета.Вставить("error",Ошибка);
   
   Возврат СформироватьJSONОтвет(КодСостояния,ДанныеОтвета);
   
КонецФункции

Функция СформироватьОтветОНехваткеСредств(Дефицит)
   
   Ошибка = Новый Структура;
   Ошибка.Вставить("code", "insufficient_funds");
   Ошибка.Вставить("message", "Недостаточно денежных средств в кассе."); 
   Ошибка.Вставить("deficit", Дефицит);
   
   ДанныеОтвета = Новый Структура;
   ДанныеОтвета.Вставить("error", Ошибка);
   
   Возврат СформироватьJSONОтвет(422, ДанныеОтвета);
   
КонецФункции

Функция СформироватьУспешныйОтветОперации(КодСостояния, ИдентификаторОперации, ДокументСсылка)
   
   ДанныеОперации = Новый Структура;
   ДанныеОперации.Вставить("operationId", ИдентификаторОперации);
   ДанныеОперации.Вставить("documentId", Строка(ДокументСсылка.УникальныйИдентификатор())); 
   ДанныеОперации.Вставить("status", "posted");
   ДанныеОтвета = Новый Структура;
   ДанныеОтвета.Вставить("data", ДанныеОперации);
   
   Возврат СформироватьJSONОтвет(КодСостояния,ДанныеОтвета);
   
КонецФункции
